{
    "_type": "news",
    "didUMean": "",
    "totalCount": 923,
    "relatedSearch": [],
    "value": [{
        "id": "3641808007858943950",
        "title": "Anushka Sharma looks ethereal in this gown as she resumes shooting; see pics",
        "url": "https://indianexpress.com/article/lifestyle/fashion/anushka-sharma-looks-ethereal-in-this-gown-as-she-resumes-shooting-see-pics-7061370/",
        "description": "Yet again, Anushka Sharma is paving the way for chic maternity fashion!",
        "body": "Anushka Sharma looks ethereal in this gown as she resumes shooting; see pics\nAnushka Sharma looks ethereal in this gown as she resumes shooting; see pics\nYet again, Anushka Sharma is paving the way for chic maternity fashion!\nBy: Lifestyle Desk| New Delhi |\nNovember 22, 2020 9:00:50 pm\nDo you like her latest look? (Photo: Instagram/anushkasharma).\nAnushka Sharma has been in the news ever since she announced her pregnancy with husband Virat Kohli The actor was recently spotted shooting for a campaign. Even though the actor was glowing as ever with the baby bump, it was her outfit that had our undivided attention. Take a look below to check out her ensemble.\nA post shared by Yash Raj Films Talent (@yashrajfilmstalent)\nThe Jab Tak Hai Jaan actor looked gorgeous in a bottle green floor-length dress. Keeping it simple, she ditched her accessories. The dress sans any sleeves featured a sleek bustier and was paired with tan faux leather flats. Making it for a casual look, she went for soft blowdried hair and her white face mask.\nThe actor shared the BTS on her Instagram stories. (Photo: Anushka Sharma/ Instagram)\nPrior to this, the actor also shared a picture of her clicked by her father in a baby pink suit. Needless to say, she looked elegant as ever. The look was again really minimal with a little golden bindi which instantly brightened up her overall vibe.",
        "keywords": "",
        "language": "en",
        "isSafe": true,
        "datePublished": "2020-11-22T15:30:50",
        "provider": {
            "name": "indianexpress"
        },
        "image": {
            "url": "",
            "height": 0,
            "width": 0,
            "thumbnail": "",
            "thumbnailHeight": 0,
            "thumbnailWidth": 0,
            "base64Encoding": "",
            "name": null,
            "title": null,
            "provider": {
                "name": "indianexpress"
            },
            "imageWebSearchUrl": null,
            "webpageUrl": "https://indianexpress.com/article/lifestyle/fashion/anushka-sharma-looks-ethereal-in-this-gown-as-she-resumes-shooting-see-pics-7061370/"
        }
    }, {
        "id": "2403442863431267004",
        "title": "The Fashion Rebel: An A-List Stylist Picked Out These Turtlenecks You'll Actually Want to Wear",
        "url": "http://eonline.com/news/811098/the-fashion-rebel-an-a-list-stylist-picked-out-these-turtlenecks-you-ll-actually-want-to-wear",
        "description": "Style advice from the woman who dresses Kate Hudson",
        "body": "Expert Columns\nRaymond Hall/GC Images\nWhen an A-list celeb stylist (especially one responsible for dressing the above style star) wants to give you winter wardrobe advice, you listen.\nTurns out, turtlenecks are back and their cooler than ever according to\nSophie Lopez\n, Kate Hudson's stylist. \"All trends come and go. What wasn't cool one season could be the \"It\" item-to-buy the next seasonthat's just how fashion goes,\" said the pro. \"As the '70s have been \"on trend\" for a few seasons now, it's only natural turtlenecks would be a key piece for fall/winter. Designers have brought them back in a retro-futuristic way, which compliments so many other trends right now, and because of that everyone is embracing them.\"\nWinter Jackets Under $100\nWhat is it about the top that this fashion expert loves? \"I think they can be really flatteringthey accentuate your face and can make your figure look elongated,\" claimed Sophie. \"They're also super cozy and comfy for the colder winter months.\"\nTrending Stories",
        "keywords": "",
        "language": "en",
        "isSafe": true,
        "datePublished": "2020-11-22T15:05:00",
        "provider": {
            "name": "eonline"
        },
        "image": {
            "url": "",
            "height": 0,
            "width": 0,
            "thumbnail": "",
            "thumbnailHeight": 0,
            "thumbnailWidth": 0,
            "base64Encoding": "",
            "name": null,
            "title": null,
            "provider": {
                "name": "eonline"
            },
            "imageWebSearchUrl": null,
            "webpageUrl": "http://eonline.com/news/811098/the-fashion-rebel-an-a-list-stylist-picked-out-these-turtlenecks-you-ll-actually-want-to-wear"
        }
    }, {
        "id": "7546945074234779238",
        "title": "The flower power fashion hidden behind a normal front door",
        "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/flower-power-fashion-hidden-behind-19323976",
        "description": "\n People travelled for miles to see the property which later became known as \"the flower power house\"\n",
        "body": "privacy notice\nInvalid Email\nThis seemingly normal terraced house on the corner of Gwendoline Street has a fascinating historythat not everyone knows about.\nBack in 1964, Sakina Ali, 76, moved into the house in Toxtethwith her one year old daughter.\nAged 21 at the time and unable to afford her rates bill, Sakina decided to set up a fashion boutique in her front room called Frilly Poppins Boutique.\nThe boutique soon became a huge hit with locals and Sakina began making all kinds of clothes for people in the city.\nBut it wasn't until 1971 that it became known as 'the flower power house', with tourists travelling for miles to see the property which Sakina had painted with a vibrant flower mural.\nPhotos of what the house used to look like in the 60s and 70s compared to what it looks like today were shared by the Liverpool: Then and Now Twitter and Facebook page.\nThe post sparked the interest of dozens of people who liked and commented on the post with fond memories of the property, before Sakina came forward herself.\nSpeaking to the ECHO, Sakina said: \"The boutique was called Frilly Poppins Boutique.\n\"I had a 13 rates bill and I couldn't pay for it. I went up to Manchester on the slow train with my baby daughter, she must have been no more than one.\n\"I bought fabric, came back and made a lot of mod gear and just opened my front living room as a boutique.\n\"That was 1964 and back then at that time there was a massive sowing industry in Liverpool.\n\"Down Duke Street it was full of sewing factories. I left school at 15 with no qualifications and went into a sewing factory.\n\"At that time you could move from one job in the morning to another in the evening.\n\"My father used to work on all the ships and he used to sell clothes and anything. I used to make rock and roll underskirts and he'd take them to the docks.\"\nThe boutique in Sakina's front room soon took off and she was making everything from dresses and jeans to chil",
        "keywords": "",
        "language": "en",
        "isSafe": true,
        "datePublished": "2020-11-22T14:30:24",
        "provider": {
            "name": "liverpoolecho"
        },
        "image": {
            "url": "",
            "height": 0,
            "width": 0,
            "thumbnail": "",
            "thumbnailHeight": 0,
            "thumbnailWidth": 0,
            "base64Encoding": "",
            "name": null,
            "title": null,
            "provider": {
                "name": "liverpoolecho"
            },
            "imageWebSearchUrl": null,
            "webpageUrl": "https://www.liverpoolecho.co.uk/news/liverpool-news/flower-power-fashion-hidden-behind-19323976"
        }
    }, {
        "id": "3407669576471704471",
        "title": "Tara Sutaria makes a fashion statement in ethereal bridal wear, says I used to shun prints earlier but now have a flurry",
        "url": "https://www.hindustantimes.com/fashion-and-trends/tara-sutaria-makes-a-fashion-statement-in-ethereal-bridal-wear-says-i-used-to-shun-prints-earlier-but-now-have-a-flurry/story-qPDuLrFx3kbv84HKsau1HL.html",
        "description": "Tara Sutaria looks wonderfully chic in traditional bridal outfits-vintage jewellery and these pictures from her latest magazine photoshoot are proof",
        "body": "If there is one youngster in the film industry who has it all from breathtaking looks to a golden voice, ballerina moves, baking and sketching skills along with blockbusters in her kitty, it has to be\nMarjaavaan\nstar Tara Sutaria. The stylish diva recently flooded the Internet with a slew of these pictures from her latest magazine photoshoot and the mercury was set soaring high courtesy her wonderfully chic look in traditional outfits and vintage jewellery.\nIn a few pictures, Tara can be seen donning ethereal bridal wear from Pakistani designer, Shehla Chatoors collection. The ensmbles look like an ode to timeless craftsmanship. The photoshoot was for Elle magazines November issue. In one of the cover pictures, Tara can be seen donning a blue strap blouse teamed with an ivory coloured lehenga, both featuring intricate details in delicate and meticulous hand embroidery.\n\nA post shared by ELLE India (@elleindia)\nMaking her own sartorial statement, Tara looked ready for a grand festive event or wedding as she uplifted the bridal appeal in an elegant, contemporary choker by Harit Zaveri Jewellers to accessorise her look, along with a set of magnificent gold kada, a finger ring and a gold mettalic wristwatch. Leaving her luscious brown tresses open in side-parting hairstyle, Tara wore a nude lipstick, rosy blush and highlighted cheeks, kohl-lined eyes, mascara-laden eyelashes, copper eyeshadow and completed her look with a tiny maroon bindi.\n\nA post shared by ELLE India (@elleindia)\nIn another cover picture, Tara can be seen dressed in a white full-sleeves blouse with cutwork designs teamed with a pale gold delicate bridal lehenga embellished with stunning intricate old world embroideries and luxurious details. Tara accessorised her look from the same Ahmedabad-based ewellery brand.\n\nA post shared by TARA (@tarasutaria)\nServing another sartorially elegant look, Tara fla",
        "keywords": "",
        "language": "en",
        "isSafe": false,
        "datePublished": "2020-11-22T12:15:56",
        "provider": {
            "name": "hindustantimes"
        },
        "image": {
            "url": "",
            "height": 0,
            "width": 0,
            "thumbnail": "",
            "thumbnailHeight": 0,
            "thumbnailWidth": 0,
            "base64Encoding": "",
            "name": null,
            "title": null,
            "provider": {
                "name": "hindustantimes"
            },
            "imageWebSearchUrl": null,
            "webpageUrl": "https://www.hindustantimes.com/fashion-and-trends/tara-sutaria-makes-a-fashion-statement-in-ethereal-bridal-wear-says-i-used-to-shun-prints-earlier-but-now-have-a-flurry/story-qPDuLrFx3kbv84HKsau1HL.html"
        }
    }, {
        "id": "9190476474452889919",
        "title": "From hard pants to consumptive chic: How pandemics influence fashion",
        "url": "https://www.cbc.ca/news/canada/newfoundland-labrador/apocalypse-then-pandemic-fashion-doomed-beauty-1.5808703?cmp=rss",
        "description": "Fashion as we know it  clothing and cosmetic trends that change from year to year  was kick-started by a pandemic, writes Ainsley Hawthorn in the latest instalment in our Apocalypse Then series.",
        "body": "\nPosted: Nov 22, 2020 8:00 AM NT | Last Updated: November 22\nThis detail of \"Ex-voto  Sainte Genevive\" by Nicolas de Largilliere, 1696, shows the fashionable powdered wigs that hid the hair loss caused by syphilis.\n(Public Domain)\nThumb through a book of fashion history, and you'll see rising and falling hemlines, an assortment of gravity-defying hairdos and trousers of every description.\nYou'll have to read between the lines, though, to uncover the many ways viruses and bacteria have shaped those styles through the ages.\nFashion as we know it  clothing and cosmetic trends that change from year to year  was kick-started by the Black Death. Before that pandemic ravaged Eurasia beginning in 1346, European attire had been more or less the same for centuries. In the mid-1300s, though, styles began to change at a faster clip.\nBecause of the plague, wealthy elites suddenly had more spending money. The Black Death wiped out at least a third of Europe's population, and the survivors inherited the fortunes of their dead relatives. As a result, per-capita wealth rose in Europe, and more people could afford regular wardrobe updates. Being able to keep up with shifting vogues became a new sign of affluence.\nSo far, the COVID pandemic hasn't exactly elevated our fashion. Instead, what The New Yorker has dubbed \"\nslob-chic\n\" is the order of the day. Pajamas are in, bras and business suits are out. The coronavirus has even settled the controversy over whether leggings qualify as pants: they certainly do. Hard pants, the garments formerly known as \"jeans\", are now officially occasion-wear.\nA dying woman reclines on a balcony as the grim reaper, representing tuberculosis, stands over her. Watercolour by Richard Tennant Cooper, ca. 1912.\n(Courtesy of the Wellcome Collection)\nAt the same time, the pandemic has introduced an all-new item t",
        "keywords": "",
        "language": "en",
        "isSafe": false,
        "datePublished": "2020-11-22T11:30:00",
        "provider": {
            "name": "cbc"
        },
        "image": {
            "url": "",
            "height": 0,
            "width": 0,
            "thumbnail": "",
            "thumbnailHeight": 0,
            "thumbnailWidth": 0,
            "base64Encoding": "",
            "name": null,
            "title": null,
            "provider": {
                "name": "cbc"
            },
            "imageWebSearchUrl": null,
            "webpageUrl": "https://www.cbc.ca/news/canada/newfoundland-labrador/apocalypse-then-pandemic-fashion-doomed-beauty-1.5808703?cmp=rss"
        }
    }, {
        "id": "5161337177904044040",
        "title": "The best gender neutral fashion from high street and sustainable brands",
        "url": "https://metro.co.uk/2020/11/22/the-best-gender-neutral-fashion-from-high-street-and-sustainable-brands-13632511/",
        "description": "Everyone from Harry Styles, Beyonc and Generation Z is in on the trend, so we've rounded up the best gender neutral fashion lines.",
        "body": "Get shopping (Picture: Getty Images/iStockphoto)\nIf youve been anywhere near the internet this week, youll likely have seen pictures from\nHarry Styles\n latest photoshoot.\nAs the first ever solo male cover star for Vogue US Harry Styles has really made a splash.\nDecked out in a Gucci ballgown and a tuxedo jacket for the cover shot, and kilts, skirts and jewellery in other photos from the shoot, Styles blurred the boundaries between masculine and feminine fashion with his gender neutral dressing.\nEven Beyonc (yes, that Beyonc) is in on the trend, with her latest Ivy Park x Adidas collection containing jumpsuits, dresses, shoes and more that have been designed for everyone in mind, regardless of gender.\nAdvertisement\nAdvertisement\nTheres good reason for it, too. Gender neutral clothing has become more and more popular in recent years, particularly amongst Generation Z, who tend to be more open-minded about gender and sexuality.\nIn fact, according to a 2016 survey carried out by The Innovation Group, only 44 percent of Generation Z respondents said that they always bought clothes designed for their own gender.\nClearly, the shoulds and should nots of fashion are being broken down, with more and more people looking to dress in clothes they feel good in, regardless of gender categories.\nBut how can you get in on the trend yourself? Well, theres a whole range of places you can look, with independent and sustainable brands and even some high street chains offering their own gender neutral lines.\nHere are some of the best places to shop online for gender neutral clothes.\nASOS\nASOS DESIGN x glaad&s gender neutral offering includes floral co-ords.\nGood old reliable ASOS really does have something for everybody. The collaboration between its own ASOS DESIGN label and glaad& is no different.\nWith everything from basic tees to loungewear sets and colourful co-ords on offer, this collection is an a",
        "keywords": "",
        "language": "en",
        "isSafe": false,
        "datePublished": "2020-11-22T10:00:20",
        "provider": {
            "name": "metro"
        },
        "image": {
            "url": "",
            "height": 0,
            "width": 0,
            "thumbnail": "",
            "thumbnailHeight": 0,
            "thumbnailWidth": 0,
            "base64Encoding": "",
            "name": null,
            "title": null,
            "provider": {
                "name": "metro"
            },
            "imageWebSearchUrl": null,
            "webpageUrl": "https://metro.co.uk/2020/11/22/the-best-gender-neutral-fashion-from-high-street-and-sustainable-brands-13632511/"
        }
    }, {
        "id": "6052289184482798674",
        "title": "Interiors: The fashion house",
        "url": "https://www.dailymail.co.uk/home/you/article-8942907/Interiors-fashion-house.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
        "description": "A joyful mix of colour and pattern, Margherita Missoni's Italian home is as bright and beautiful as her family's famous fashion brand",
        "body": "Rubelli.com\n. The astrology-inspired rug is a Missoni prototype\nA joyful mix of colour and pattern, Margherita Missonis Italian home is as bright and beautiful as her familys famous fashion brand\nMargherita in the dining room. The forest wall mural was handpainted by Pictalab\nWith one of the most famous names in fashion, you may think it surprising that Margherita Missoni, granddaughter of Missoni founder Rosita, has chosen to take up residence in a small Italian town around 35 miles north of Milan.\nVarese, however, is the Missoni familys hometown, where Margherita grew up. I have very deep roots, she says. I love the provincial life, and its a good contrast to fashion and all that glitter. Working in collaboration with the studio founded by legendary designer and architect Aldo Cibic, Margherita and her husband, racing car driver Eugenio Amos, built a family home that feels both grand and intimate. We wanted a house that changes with the seasons, says Margherita. In the summer its flooded with light, and in the winter it feels warm and cosy.\nPart of the houses intimate feel comes from the pieces that fill it. Im a hoarder, laughs Margherita. I still have stuff I bought in New York when I was 20, which I took to Rome, to Milan, and now here. Everything tells a story. The spoils from these travels, along with Ebay and flea-market finds, are dotted throughout the house and mixed in with heirloom pieces.\nRELATED ARTICLES",
        "keywords": "",
        "language": "en",
        "isSafe": true,
        "datePublished": "2020-11-22T00:02:46",
        "provider": {
            "name": "dailymail"
        },
        "image": {
            "url": "",
            "height": 0,
            "width": 0,
            "thumbnail": "",
            "thumbnailHeight": 0,
            "thumbnailWidth": 0,
            "base64Encoding": "",
            "name": null,
            "title": null,
            "provider": {
                "name": "dailymail"
            },
            "imageWebSearchUrl": null,
            "webpageUrl": "https://www.dailymail.co.uk/home/you/article-8942907/Interiors-fashion-house.html?ns_mchannel=rss&ns_campaign=1490&ito=1490"
        }
    }, {
        "id": "7138740202253195817",
        "title": "The edit: 10 of the best jumpsuits",
        "url": "https://www.theguardian.com/fashion/gallery/2020/nov/21/the-edit-10-of-the-best-jumpsuits-in-pictures",
        "description": "If cocooning yourself in leggings and athleisure has left you wanting a new look for lockdown 2.0, then a jumpsuit is the answer",
        "body": " 2020 Guardian News & Media Limited or its affiliated companies. All rights reserved.\nClose",
        "keywords": "",
        "language": "en",
        "isSafe": true,
        "datePublished": "2020-11-21T23:50:06",
        "provider": {
            "name": "theguardian"
        },
        "image": {
            "url": "",
            "height": 0,
            "width": 0,
            "thumbnail": "",
            "thumbnailHeight": 0,
            "thumbnailWidth": 0,
            "base64Encoding": "",
            "name": null,
            "title": null,
            "provider": {
                "name": "theguardian"
            },
            "imageWebSearchUrl": null,
            "webpageUrl": "https://www.theguardian.com/fashion/gallery/2020/nov/21/the-edit-10-of-the-best-jumpsuits-in-pictures"
        }
    }, {
        "id": "1101621713046847671",
        "title": "Best Old Navy Gifts For Women 2020",
        "url": "https://www.popsugar.com/fashion/best-old-navy-gifts-for-women-2020-47989028",
        "description": "If you're like us and can't stop dreaming about the holiday season, then you might already be thinking about putting together your shopping lists for everyone",
        "body": " Use Arrow Keys \n0\nShirred Velvet Short-Sleeve Top\nIf you're like us and can't stop dreaming about the holiday season, then you might already be thinking about putting together your shopping lists for everyone in your life (maybe some\n?). If there's a woman in your life you plan on shopping for, we've put together our favorite affordable items from Old Navy. From new coatsto slippers and cozy sweaters here are 23 gifts she'll absolutely love.\nRelated:",
        "keywords": "",
        "language": "en",
        "isSafe": true,
        "datePublished": "2020-11-21T17:05:03",
        "provider": {
            "name": "popsugar"
        },
        "image": {
            "url": "",
            "height": 0,
            "width": 0,
            "thumbnail": "",
            "thumbnailHeight": 0,
            "thumbnailWidth": 0,
            "base64Encoding": "",
            "name": null,
            "title": null,
            "provider": {
                "name": "popsugar"
            },
            "imageWebSearchUrl": null,
            "webpageUrl": "https://www.popsugar.com/fashion/best-old-navy-gifts-for-women-2020-47989028"
        }
    }, {
        "id": "8369355001671063311",
        "title": "The New York Times",
        "url": "https://www.nytimes.com/by/vanessa-friedman",
        "description": "Vanessa Friedman was named the fashion director and chief fashion critic for The New York Times in March 2014. In this role she leads global fashion coverage for both The New York Times and International New York Times.\r\nBefore joining the paper, Ms. Friedman was the inaugural fashion editor of the Financial Times, beginning in 2003. Along with editing the Style pages and the Luxury360 vertical, she wrote a weekly column for the Saturday FT and created the FT's annual Business of Luxury conference.\r\nPreviously, she was the fashion features director for InStyle UK, from 2000 to 2002. Before that she worked as a Fashion Correspondent for the FT, as an Arts Contributor at The Economist and was the European Editor at American Elle. In addition she contributed regularly to Vogue, The New Yorker, Vanity Fair and Entertainment Weekly.\r\nShe is the author of \"Emilio Pucci\" (Taschen) as well as an honorary professor at Glasgow-Caledonian University. She was the recipient of the 2012 Front Page Award for fashion writing, as well as the 2013 Fashion Monitor Journalist of the Year award.\r\nMs. Friedman received her undergraduate degree from Princeton University.",
        "body": "Todays Paper\nVanessa Friedman\nVanessa Friedman was named the fashion director and chief fashion critic for The New York Times in March 2014. In this role she leads global fashion coverage for both The New York Times and International New York Times.\nMore",
        "keywords": "",
        "language": "en",
        "isSafe": true,
        "datePublished": "2020-11-21T14:00:09",
        "provider": {
            "name": "nytimes"
        },
        "image": {
            "url": "",
            "height": 0,
            "width": 0,
            "thumbnail": "",
            "thumbnailHeight": 0,
            "thumbnailWidth": 0,
            "base64Encoding": "",
            "name": null,
            "title": null,
            "provider": {
                "name": "nytimes"
            },
            "imageWebSearchUrl": null,
            "webpageUrl": "https://www.nytimes.com/by/vanessa-friedman"
        }
    }]
}
